# DataTransferProgressChangedEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DataTransferProgressChangedEventArgs Members
DataTransferProgressChangedEventArgs Class Methods Properties See Also
---
The DataTransferProgressChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RevitAPIEventArgs.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCancelled | Indicates whether the event is being cancelled.  (Inherited from RevitAPIEventArgs.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| FinishedSize | The transferred data size, in bytes, since the last time this event was raised. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| Location | Full path of the central model which is to be operated.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| Speed | Speed(bytes/second) in this event. |
| Status | Gets API event status, reflect current operation execution status.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| TotalSize | Total expected data size to transfer, in bytes. |
| TransferMode | Data transfer mode in this event. |

# See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace